<a href="https://colab.research.google.com/github/mariuszDolinski/Data-Science-Course/blob/main/Pandas_Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
pd.__version__

'2.2.2'

In [ ]:
s = pd.Series(data=[2,5,4,3], index=['a', 'b', 'c', 'd'], name='sample')
s

a    2
b    5
c    4
d    3
Name: sample, dtype: int64

In [7]:
import numpy as np

In [ ]:
s = pd.Series(data=[2, np.nan, 4, 3], index=['a', 'b', 'c', 'd'], name='sample') #nan - brak danej, nie uwzglÄ™dniona w obliczeniach statystycznych
s

a    2.0
b    NaN
c    4.0
d    3.0
Name: sample, dtype: float64

In [ ]:
s = pd.Series(data=[True, False, True], name='sample-bool')
s

0     True
1    False
2     True
Name: sample-bool, dtype: bool

In [8]:
s = pd.Series(data=np.arange(10, 20), index=pd.date_range(start='20250101', periods=10)) #daty jako indeksy
s

2025-01-01    10
2025-01-02    11
2025-01-03    12
2025-01-04    13
2025-01-05    14
2025-01-06    15
2025-01-07    16
2025-01-08    17
2025-01-09    18
2025-01-10    19
Freq: D, dtype: int64

In [9]:
s.index

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10'],
              dtype='datetime64[ns]', freq='D')

In [10]:
 s = pd.Series(data=['python', 'java', 'sql'], name='languages')
s

0    python
1      java
2       sql
Name: languages, dtype: object

In [4]:
type(s)

pandas.core.series.Series

In [11]:
list(s.index)

[0, 1, 2]

In [13]:
s.values

array(['python', 'java', 'sql'], dtype=object)

In [14]:
s.dtypes # O - Object

dtype('O')

In [15]:
s.shape

(3,)

In [34]:
price = pd.Series(data={'Apple': 200, 'CD Projekt': 60, 'Amazon': 1900, 'KGHM': np.nan})
price

Apple          200.0
CD Projekt      60.0
Amazon        1900.0
KGHM             NaN
dtype: float64

In [19]:
price['CD Projekt']

60

In [20]:
price[1]

<ipython-input-20-36dbb2ffbeb5>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  price[1]

60

In [27]:
price.count()

3

In [35]:
price.value_counts(dropna=False)

200.0     1
60.0      1
1900.0    1
NaN       1
Name: count, dtype: int64

In [23]:
price.sum()

2160

In [24]:
price.min()

60

In [25]:
price.std()

1024.3046421841502

In [26]:
price.describe()

count       3.000000
mean      720.000000
std      1024.304642
min        60.000000
25%       130.000000
50%       200.000000
75%      1050.000000
max      1900.000000
dtype: float64

In [32]:
price.nlargest(2)

Amazon    1900
Apple      200
dtype: int64

In [33]:
price.nsmallest(1)

CD Projekt    60
dtype: int64

In [36]:
price.rank()

Apple         2.0
CD Projekt    1.0
Amazon        3.0
KGHM          NaN
dtype: float64

In [37]:
price.sort_values()

CD Projekt      60.0
Apple          200.0
Amazon        1900.0
KGHM             NaN
dtype: float64

In [38]:
price.sort_values(ascending=False)

Amazon        1900.0
Apple          200.0
CD Projekt      60.0
KGHM             NaN
dtype: float64

In [40]:
price_pln = price.apply(lambda x: x * 3.8)

In [41]:
price_pln

Apple          760.0
CD Projekt     228.0
Amazon        7220.0
KGHM             NaN
dtype: float64